Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/svd/PIC32CZ8110CA90176.svd
            <register>
               <dim>2</dim>
               <dimIncrement>4</dimIncrement>
               <name>COMPCTRL[%s]</name>
               <description>Pair n Comparator Control 0</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SINGLE</name>
                     <description>Single-Shot Mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INTSEL</name>
                     <description>Interrupt Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>INTSELSelect</name>
                        <enumeratedValue>
                           <name>TOGGLE</name>
                           <description>Interrupt on comparator output toggle</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISING</name>
                           <description>Interrupt on comparator output rising</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALLING</name>
                           <description>Interrupt on comparator output falling</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EOC</name>
                           <description>Interrupt on end of comparison (single-shot mode only)</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MUXNEG</name>
                     <description>Negative Input Mux Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>MUXNEGSelect</name>
                        <enumeratedValue>
                           <name>PIN0</name>
                           <description>I/O pin 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN1</name>
                           <description>I/O pin 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN2</name>
                           <description>I/O pin 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN3</name>
                           <description>I/O pin 3</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT0</name>
                           <description>Internal connection 0, device specific</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANDGAP</name>
                           <description>Bangap</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GND</name>
                           <description>Ground</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTDAC</name>
                           <description>Internal DAC</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXPOS</name>
                     <description>Positive Input Mux Selection</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>MUXPOSSelect</name>
                        <enumeratedValue>
                           <name>PIN0</name>
                           <description>I/O pin 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN1</name>
                           <description>I/O pin 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN2</name>
                           <description>I/O pin 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PIN3</name>
                           <description>I/O pin 3</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT0</name>
                           <description>Internal connection 0, device specific</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT1</name>
                           <description>Internal connection 1, device specific</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT2</name>
                           <description>Internal connection 2, device specific</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTDAC</name>
                           <description>Internal DAC</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SWAP</name>
                     <description>Swap Inputs and Invert</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPEED</name>
                     <description>Speed Selection</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SPEEDSelect</name>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>High speed, high power</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Low speed, low power</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>HYST</name>
                     <description>Hysteresis Level</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>HYSTSelect</name>
                        <enumeratedValue>
                           <name>HYST10</name>
                           <description>10mV</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HYST20</name>
                           <description>20mV</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HYST40</name>
                           <description>40mV</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HYST60</name>
                           <description>60mV</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLEN</name>
                     <description>Filter Length</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>FLENSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>No filtering</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAJ3</name>
                           <description>3-bit majority function (2 of 3)</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MAJ5</name>
                           <description>5-bit majority function (3 of 5)</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OUT</name>
                     <description>Output</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OUTSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>The output of COMPn is not routed to the COMPn I/O port</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ASYNC</name>
                           <description>The asynchronous output of COMPn is routed to the COMPn I/O port</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SYNC</name>
                           <description>The synchronous output (including filtering) of COMPn is routed to the COMPn I/O port</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SUT</name>
                     <description>Start-up Time</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DACCTRL</name>
               <description>Dac Control</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VALUE0</name>
                     <description>DAC0 Output Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SHEN0</name>
                     <description>DAC0 Sample and Hold Enable Operating Mode</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VALUE1</name>
                     <description>DAC1 Output Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>SHEN1</name>
                     <description>DAC1 Sample and Hold Enable Operating Mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WINCTRL</name>
               <description>Window Monitor Control</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
            </register>
