Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/svd/PIC32CZ8110CA90176.svd
            <register>
               <name>FCTRLB</name>
               <description>Recoverable Fault B Configuration</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRC</name>
                     <description>Fault B Source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SRCSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Fault input disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>MCEx (x=0,1) event input</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INVERT</name>
                           <description>Inverted MCEx (x=0,1) event input</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ALTFAULT</name>
                           <description>Alternate fault (A or B) state at the end of the previous period</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEEP</name>
                     <description>Fault B Keeper</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QUAL</name>
                     <description>Fault B Qualification</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLANK</name>
                     <description>Fault B Blanking Mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>BLANKSelect</name>
                        <enumeratedValue>
                           <name>START</name>
                           <description>Blanking applied from start of the ramp</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISE</name>
                           <description>Blanking applied from rising edge of the output waveform</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FALL</name>
                           <description>Blanking applied from falling edge of the output waveform</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BOTH</name>
                           <description>Blanking applied from each toggle of the output waveform</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RESTART</name>
                     <description>Fault B Restart</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HALT</name>
                     <description>Fault B Halt Mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>HALTSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Halt action disabled</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HW</name>
                           <description>Hardware halt action</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SW</name>
                           <description>Software halt action</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NR</name>
                           <description>Non-recoverable fault</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CHSEL</name>
                     <description>Fault B Capture Channel</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CHSELSelect</name>
                        <enumeratedValue>
                           <name>CC0</name>
                           <description>Capture value stored in channel 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CC1</name>
                           <description>Capture value stored in channel 1</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CC2</name>
                           <description>Capture value stored in channel 2</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CC3</name>
                           <description>Capture value stored in channel 3</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CAPTURE</name>
                     <description>Fault B Capture Action</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>CAPTURESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>No capture</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPT</name>
                           <description>Capture on fault</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPTMIN</name>
                           <description>Minimum capture</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPTMAX</name>
                           <description>Maximum capture</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCMIN</name>
                           <description>Minimum local detection</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOCMAX</name>
                           <description>Maximum local detection</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DERIV0</name>
                           <description>Minimum and maximum local detection</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CAPTMARK</name>
                           <description>Capture with ramp index as MSB value</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BLANKPRESC</name>
                     <description>Fault B Blanking Prescaler</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLANKVAL</name>
                     <description>Fault B Blanking Time</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>FILTERVAL</name>
                     <description>Fault B Filter Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WEXCTRL</name>
               <description>Waveform Extension Configuration</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OTMX</name>
                     <description>Output Matrix</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>DTIEN0</name>
                     <description>Dead-time Insertion Generator 0 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTIEN1</name>
                     <description>Dead-time Insertion Generator 1 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTIEN2</name>
                     <description>Dead-time Insertion Generator 2 Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTIEN3</name>
                     <description>Dead-time Insertion Generator 3 Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTLS</name>
                     <description>Dead-time Low Side Outputs Value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>DTHS</name>
                     <description>Dead-time High Side Outputs Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DRVCTRL</name>
               <description>Driver Control</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>NRE0</name>
                     <description>Non-Recoverable State 0 Output Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE1</name>
                     <description>Non-Recoverable State 1 Output Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE2</name>
                     <description>Non-Recoverable State 2 Output Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE3</name>
                     <description>Non-Recoverable State 3 Output Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE4</name>
                     <description>Non-Recoverable State 4 Output Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE5</name>
                     <description>Non-Recoverable State 5 Output Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE6</name>
                     <description>Non-Recoverable State 6 Output Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRE7</name>
                     <description>Non-Recoverable State 7 Output Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV0</name>
                     <description>Non-Recoverable State 0 Output Value</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV1</name>
                     <description>Non-Recoverable State 1 Output Value</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV2</name>
                     <description>Non-Recoverable State 2 Output Value</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV3</name>
                     <description>Non-Recoverable State 3 Output Value</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV4</name>
                     <description>Non-Recoverable State 4 Output Value</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV5</name>
                     <description>Non-Recoverable State 5 Output Value</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV6</name>
                     <description>Non-Recoverable State 6 Output Value</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NRV7</name>
                     <description>Non-Recoverable State 7 Output Value</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN0</name>
                     <description>Output Waveform 0 Inversion</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN1</name>
                     <description>Output Waveform 1 Inversion</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN2</name>
                     <description>Output Waveform 2 Inversion</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN3</name>
                     <description>Output Waveform 3 Inversion</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN4</name>
                     <description>Output Waveform 4 Inversion</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN5</name>
                     <description>Output Waveform 5 Inversion</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN6</name>
                     <description>Output Waveform 6 Inversion</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>INVEN7</name>
                     <description>Output Waveform 7 Inversion</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FILTERVAL0</name>
                     <description>Non-Recoverable Fault Input 0 Filter Value</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FILTERVAL1</name>
                     <description>Non-Recoverable Fault Input 1 Filter Value</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0x1E</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Running Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FDDBD</name>
                     <description>Fault Detection on Debug Break Detection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
